//     Створіть функцію sum, яка буде мати один параметр типу number.
//     Кожен виклик функції має додавати нове число до попередніх і повертати суму, яку можна показати користувачу.
//     Наприклад:
//
// const result = sum(1) // Перший виклик
// console.log(result) // -> 1
//
// const secondResult = sum(2)
// console.log(secondResult) // -> 3
//
// sum(4)
// sum(8)
// const lastResult = sum(11)
// console.log(lastResult) // -> 26
//
//     Функція sum не повинна ніяким чином не повинна звертатись до будь-яких змінних або змінювати їх у глобальному лексичному середовищі!





